src/Documents/ВыполнениеРаботНадПроектом/ВыполнениеРаботНадПроектом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыполнениеРаботНадПроектом</name>
  <registerRecords>InformationRegister.ВремяВыполненияПроектов</registerRecords>
  <registerRecords>InformationRegister.УП_ВремяВыполнениеПроектов_Факт</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Исполнители</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполненияДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Проекты</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВыполнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ВремяВыполненияПроектов/ВремяВыполненияПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВремяВыполненияПроектов</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Исполнители</types>
    </type>
  </resources>
  <resources>
    <name>ВремяВыполнения_План</name>
    <comment>в минутах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяВыполнения_Факт</name>
    <comment>в минутах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>РегистраторСсылка</name>
    <type>
      <types>DocumentRef.ВыполнениеПроектов</types>
      <types>DocumentRef.СогласованиеПроектов</types>
      <types>DocumentRef.ИзменениеСостоянияПроектов</types>
      <types>DocumentRef.ВыполнениеРаботНадПроектом</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/УП_ВремяВыполнениеПроектов_Факт/УП_ВремяВыполнениеПроектов_Факт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УП_ВремяВыполнениеПроектов_Факт</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Исполнители</types>
    </type>
  </resources>
  <resources>
    <name>ВремяВыполнения</name>
    <comment>(в минутах)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>АналитикаУчетаПоКонтрагентам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоКонтрагентам</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ВыполнениеРаботНадПроектом/ObjectModule.bsl
//////////////////////////////////////////////////////////////////////////////////
//// РАЗДЕЛ ПРОЦЕДУР И ФУНКЦИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ВремяВыполнения = 0;
	Для каждого ТекСтрока Из Проекты Цикл
		ВремяВыполнения = ВремяВыполнения + УП_ОбщегоНазначения_Сервер.ПреобразоватьВремя(ТекСтрока.ВремяВыполнения);
	КонецЦикла;
	ВремяВыполненияДокумента = УП_ОбщегоНазначения_Сервер.ПреобразоватьЧислоВВремя_Строка(ВремяВыполнения);
	
КонецПроцедуры

// Обработка проведения документа.
// ................................................................................
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Для каждого ТекСтрока Из Проекты Цикл
		// регистр ВремяВыполненияПроектов
		Движения.ВремяВыполненияПроектов.Записывать = Истина;
		Движение                      = Движения.ВремяВыполненияПроектов.Добавить();
		Движение.РегистраторСсылка    = Ссылка;
		Движение.Контрагент           = Контрагент;
		Движение.Проект               = ТекСтрока.Проект;
		Движение.ВремяВыполнения_План = 0;
		Движение.ВремяВыполнения_Факт = УП_ОбщегоНазначения_Сервер.ПреобразоватьВремя(ТекСтрока.ВремяВыполнения);
		Движение.Исполнитель          = Исполнитель;
	КонецЦикла;
	
	// регистр УП_ВремяВыполнения_Факт
	Движения.УП_ВремяВыполнениеПроектов_Факт.Записывать = Истина;
	Для Каждого ТекСтрокаПроекты Из Проекты Цикл
		ПараметрыАналитики = Новый Структура();
		ПараметрыАналитики.Вставить("Контрагент", Контрагент);
		ПараметрыАналитики.Вставить("Клиент"    , ТекСтрокаПроекты.Клиент);
		ПараметрыАналитики.Вставить("Проект"    , ТекСтрокаПроекты.Проект);
		
		Движение                              = Движения.УП_ВремяВыполнениеПроектов_Факт.Добавить();
		Движение.Период                       = Дата;
		Движение.АналитикаУчетаПоКонтрагентам = УП_РаботаСДокументамиСервер.ЗначениеКлючаАналитики(ПараметрыАналитики);
		Движение.Исполнитель                  = Исполнитель;
		Движение.ВремяВыполнения              = УП_ОбщегоНазначения_Сервер.ПреобразоватьВремя(ТекСтрокаПроекты.ВремяВыполнения);
	КонецЦикла;
	
КонецПроцедуры
